In [6]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd
data = [4, 8, 15, 16, 23, 42]
df = pd.Series(data)
type(df)

pandas.core.series.Series

In [7]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

data = [4, 8, 15, 16, 23, 42]
df = pd.Series(data)
type(df)

pandas.core.series.Series

In [15]:
# Q3. Create a Pandas DataFrame that contains the following data:

data1 = {"Name":["Alice","Bob","Clair"],
      "Age":[25,30,27],
      "Gender": ["Female","Male","Female"]}
df1 = pd.DataFrame(data1)
df1

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clair   27  Female

In [19]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# Dataframe is a whole table with rows and columns, while series is just columns in a Dataframe. 

type(df1)

pandas.core.frame.DataFrame

In [20]:
type(df1["Name"])

pandas.core.series.Series

In [24]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
# head - to check the top5 rows of the dataframe by default, we can change the no. of rows as well
# tail - to check the last 5 rows of the dataframe
# data filteration - to print the particular columns, to get mupltiple colmns, add new coumn etc
# columns  - to check the column names. 
# describe  to get the summary of the dataframe, which include, mean, count, sd, min, max
# dtypes - to get the type of the columns

In [25]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

# Series and dataframe are mutable in nature, but not panel.

In [28]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

name = pd.Series(["Bob", "Rob","Alex"])
age = pd.Series([23,26,30])
income = pd.Series([20000,50000,110000])

df2 = pd.DataFrame({
    "Name":name,
    "Age":age,
    "Income":income
})

df2

   Name  Age  Income
0   Bob   23   20000
1   Rob   26   50000
2  Alex   30  110000